# 第五章 pandas入门

## pandas的数据结构介绍

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,7,-5,3],index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [9]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2[['c','a','b']]

c    3
a   -5
b    7
dtype: int64

In [11]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)

In [18]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
obj4.name = 'Population'
obj4.index.name = 'State'
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [28]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [29]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [30]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [31]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
pd.DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [34]:
frame2 = pd.DataFrame(data,columns = ['year','state','pop','debt'],
                     index = ['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [35]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [36]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [37]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [38]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [39]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [40]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [41]:
val = pd.Series([-1.2,-1.5,-1.7],index = ['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [42]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [43]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [45]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

这个地方不太明白，为什么会出错？？？真的很奇怪

In [48]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
pd.DataFrame(pop,index=[2001,2002,2003])

AttributeError: 'list' object has no attribute 'astype'

In [49]:
pdata = {'Ohio':frame3['Ohio'][:-1],'nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  nevada
2000   1.5     NaN
2001   1.7     2.4

In [51]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [52]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [53]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [54]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [56]:
obj = pd.Series(range(3),index = ['a','b','c'])
index = obj.index

In [57]:
index

Index(['a', 'b', 'c'], dtype='object')

In [58]:
index[1:]

Index(['b', 'c'], dtype='object')

In [59]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [60]:
index[1]

'b'

In [61]:
labels = pd.Index(np.arange(3))

In [62]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [63]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)

In [64]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [65]:
obj2.index is labels

True

In [66]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [67]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [68]:
'Ohio' in frame3.columns

True

In [69]:
2003 in frame3.index

False

In [70]:
dup_labels = pd.Index(['foo','foo','bar','bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 基本功能

In [71]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [72]:
obj2 = obj[['a','b','c','a','d']]
obj2

a   -5.3
b    7.2
c    3.6
a   -5.3
d    4.5
dtype: float64

In [73]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [74]:
obj3 = pd.Series(['blue','purple','yellow'],index = [0,2,4])

In [75]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [76]:
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [77]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index = ['a','c','d'],columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [78]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [79]:
states = ['Texas','Utah','California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [80]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [81]:
new_obj = obj.drop('c')

In [82]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [83]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [84]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [87]:
data.drop(['two','four'],axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [88]:
obj.drop('c',inplace = True)

In [89]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
obj = pd.Series(np.arange(4.),index = ['a','b','c','d'])

In [91]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [92]:
obj['b']

1.0

In [93]:
obj[1]

1.0

In [94]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [95]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [96]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [97]:
obj[obj>2]

d    3.0
dtype: float64

In [98]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [99]:
obj['b':'c'] = 5

In [100]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [101]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])

In [102]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [104]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [105]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [106]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [108]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [1]:
data.iloc[2,[3,0,1]]

NameError: name 'data' is not defined

In [ ]:
data.iloc[2]

In [ ]:
data.iloc[[1,2],[3,0,1]]

In [ ]:
data

In [2]:
import pandas as pd
import numpy as np

In [3]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [4]:
ser[-1]

KeyError: -1

In [5]:
ser[1]

1.0

In [6]:
ser2 = pd.Series(np.arange(3.),index = ['a','b','c'])
ser2[-1]

2.0

In [7]:
ser[:1]

0    0.0
dtype: float64

In [8]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [9]:
ser.iloc[:1]

0    0.0
dtype: float64

In [10]:
s1 = pd.Series([7.3,-2.5,3.4,1.5],index = ['a','c','d','e'])
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],index = ['a','c','e','f','g'])

In [11]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [12]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [13]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [15]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns = list('bcd'),
                  index = ['Ohio','Texas','Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),columns = list('bde'),
                  index = ['Utah','Ohio','Texas','Oregon'])

In [16]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [17]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [18]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [19]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3,4]})

In [20]:
df1

   A
0  1
1  2

In [21]:
df2

   B
0  3
1  4

In [22]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [23]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),columns = list('abcde'))

In [24]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [25]:
df2.loc[1,'b'] = np.nan

In [26]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [27]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [28]:
df1.add(df2,fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [29]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [30]:
1/df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [31]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [32]:
df1.reindex(columns = df2.columns,fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [33]:
arr = np.arange(12.).reshape(3,4)

In [34]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [35]:
arr[0]

array([0., 1., 2., 3.])

In [36]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [37]:
frame = pd.DataFrame(np.arange(12.).reshape(4,3),columns = list('bde'),
                    index = ['Utah','Ohio','Texas','Oregon'])
series = frame.iloc[0]

In [38]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [39]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [40]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [41]:
series2 = pd.Series(range(3),index = ['b','e','f'])
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [42]:
series3 = frame['d']

In [43]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [44]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [45]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [46]:
frame - series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [47]:
frame.sub(series3,axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [49]:
frame = pd.DataFrame(np.random.randn(4,3),columns = list('bde'),index = 
                    ['Utah','Ohio','Texas','Oregon'])

In [50]:
frame

               b         d         e
Utah    0.849576 -0.692806 -0.411312
Ohio    0.448543 -0.408891 -1.442226
Texas  -1.175452 -0.140603 -1.003347
Oregon -0.859326 -0.502663  0.049703

In [51]:
np.abs(frame)

               b         d         e
Utah    0.849576  0.692806  0.411312
Ohio    0.448543  0.408891  1.442226
Texas   1.175452  0.140603  1.003347
Oregon  0.859326  0.502663  0.049703

In [52]:
f = lambda x:x.max() - x.min()

In [53]:
frame.apply(f)

b    2.025028
d    0.552203
e    1.491929
dtype: float64

In [54]:
frame.apply(f,axis = 1)

Utah      1.542381
Ohio      1.890769
Texas     1.034849
Oregon    0.909029
dtype: float64

In [55]:
def f(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])

In [56]:
frame.apply(f)

            b         d         e
min -1.175452 -0.692806 -1.442226
max  0.849576 -0.140603  0.049703

In [57]:
format = lambda x:'%.2f'%x

In [58]:
frame.applymap(format)

            b      d      e
Utah     0.85  -0.69  -0.41
Ohio     0.45  -0.41  -1.44
Texas   -1.18  -0.14  -1.00
Oregon  -0.86  -0.50   0.05

In [59]:
frame['e'].map(format)

Utah      -0.41
Ohio      -1.44
Texas     -1.00
Oregon     0.05
Name: e, dtype: object

In [60]:
obj = pd.Series(range(4),index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [61]:
frame = pd.DataFrame(np.arange(8).reshape(2,4),index = ['three','one'],
                    columns = ['d','a','b','c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [62]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [63]:
frame.sort_index(axis = 1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [64]:
obj = pd.Series([4,7,-3,2])

In [65]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [66]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])

In [67]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [68]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [70]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [71]:
frame.sort_values(by = ['b','a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [72]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [73]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [74]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [75]:
obj.rank(ascending = False,method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [76]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [77]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [78]:
obj = pd.Series(range(5),index = ['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [79]:
obj.index.is_unique

False

In [80]:
obj['a']

a    0
a    1
dtype: int64

In [81]:
obj['c']

4

In [82]:
df = pd.DataFrame(np.random.randn(4,3),index = ['a','a','b','b'])
df

          0         1         2
a -0.131351 -1.276022 -0.143014
a  0.138121  0.149369 -1.800059
b -1.159841 -0.535338 -0.058919
b -0.642334  0.767297 -2.027798

In [83]:
df.loc['b']

          0         1         2
b -1.159841 -0.535338 -0.058919
b -0.642334  0.767297 -2.027798

In [85]:
df[0]

a   -0.131351
a    0.138121
b   -1.159841
b   -0.642334
Name: 0, dtype: float64

## 汇总和计算描述统计

In [86]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index = ['a','b','c','d'],
                 columns = ['one','two'])

In [87]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [88]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [89]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [90]:
df.mean(axis = 1,skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [91]:
df.idxmax()

one    b
two    d
dtype: object

In [92]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [93]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [95]:
obj = pd.Series(['a','a','b','c']*4)

In [96]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [97]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### 唯一值、值计算以及成员资格

In [98]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()

In [99]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [100]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [101]:
pd.value_counts(obj.values,sort = False)

a    3
d    1
b    2
c    3
dtype: int64

In [102]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [104]:
mask = obj.isin(['b','c'])

In [105]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [106]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [107]:
to_match = pd.Series(['c','a','b','b','c','a'])
unique_vals = pd.Series(['c','b','a'])

In [108]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [109]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})

In [110]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [111]:
result = data.apply(pd.value_counts).fillna(0)

In [112]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [114]:
pd.value_counts(data)

ValueError: could not broadcast input array from shape (5,3) into shape (5)

# 第六章 数据加载、存储与文件格式

In [115]:
df = pd.read_csv('pydata-book-2nd-edition/examples/ex1.csv')

In [116]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [118]:
pd.read_table('pydata-book-2nd-edition/examples/ex1.csv',sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [119]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [120]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv',names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [121]:
names = ['a','b','c','d','message']

In [122]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv',names = names,index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [123]:
parsed = pd.read_csv('pydata-book-2nd-edition/examples/csv_mindex.csv',index_col = ['key1','key2'])

In [125]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [126]:
list(open('pydata-book-2nd-edition/examples/ex3.csv'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [127]:
result = pd.read_table('pydata-book-2nd-edition/examples/ex3.csv',sep = '\s+')

In [128]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [130]:
pd.read_csv('pydata-book-2nd-edition/examples/ex3.csv')

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [132]:
pd.read_csv('pydata-book-2nd-edition/examples/ex4.csv',skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [133]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')

In [134]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [135]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [136]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv',na_values = ['NULL'])

In [137]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [138]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [139]:
pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv',na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 逐块读取文本文件

In [140]:
pd.options.display.max_rows = 10

In [141]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv')

In [142]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [143]:
pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv',nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [145]:
chunker = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv',chunksize = 1000)

In [146]:
chunker

In [147]:
chunker = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv',chunksize = 1000)

In [149]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)

tot = tot.sort_values(ascending = False)

In [150]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### 将数据写出到文本格式

In [151]:
data = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')

In [152]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [153]:
data.to_csv('pydata-book-2nd-edition/examples/out.csv')

In [154]:
import sys
data.to_csv(sys.stdout,sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [155]:
data.to_csv(sys.stdout,na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [156]:
data.to_csv(sys.stdout,index = False,header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [157]:
data.to_csv(sys.stdout,index = False,columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [158]:
dates = pd.date_range('1/1/2000',periods = 7)
ts = pd.Series(np.arange(7),index = dates)
ts.to_csv('pydata-book-2nd-edition/examples/tseries.csv')

处理分隔符格式

In [1]:
import csv
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

In [2]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [3]:
with open('pydata-book-2nd-edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [4]:
header,values = lines[0],lines[1:]

In [5]:
data_dict = {h: v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [9]:
f = open('pydata-book-2nd-edition/examples/ex7.csv')
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f,dialect = my_dialect)

In [10]:
reader = csv.reader(f,delimiter = '|')

In [11]:
with open('mydata.csv','w') as f :
    writer = csv.writer(f,dialect = my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [15]:
obj = '''
{'name':'Wes',
'places_lived':['United States','Spain','Germany'],
'pet':null,
'siblings':[{'name':'Scott','age':30,'pets':['Zeus','Zuko']},
{'name':'Katie','age':38,
'pets':['Sixes','Stache','Cisco']}]}
'''

In [16]:
import json
result = json.loads(obj)

JSONDecodeError: Expecting property name enclosed in double quotes: line 2 column 2 (char 2)

In [18]:
import pandas as pd
tables = pd.read_html('pydata-book-2nd-edition/examples/fdic_failed_bank_list.html')

In [19]:
len(tables)

1

In [20]:
failures = tables[0]

In [21]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [22]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [24]:
from lxml import objectify
path = 'pydata-book-2nd-edition/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot

In [25]:
data = []
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

AttributeError: 'cython_function_or_method' object has no attribute 'INDICATOR'

## 二进制数据格式

In [26]:
frame = pd.read_csv('pydata-book-2nd-edition/examples/ex1.csv')

In [27]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
frame.to_pickle('pydata-book-2nd-edition/examples/frame_pickle')

In [29]:
pd.read_pickle('pydata-book-2nd-edition/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 使用HDF5格式

In [31]:
import numpy as np
frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('pydata-book-2nd-edition/mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: pydata-book-2nd-edition/mydata.h5

In [32]:
store['obj1']

           a
0   0.775751
1  -1.815641
2  -0.938153
3  -0.105750
4  -1.050281
5  -0.855215
6   0.092672
7   0.109531
8  -1.169118
9  -0.299392
10  2.062966
11 -0.274239
12 -2.192404
13 -0.980734
14  1.468118
15 -2.503070
16 -0.680329
17 -1.128819
18 -1.784636
19  1.641817
20 -0.282318
21  0.632270
22  1.222963
23  0.355070
24 -1.022937
25 -0.004119
26 -0.323259
27 -0.160274
28 -0.433215
29  0.731179
..       ...
70  1.173397
71 -0.234243
72  0.089096
73  0.357353
74 -0.757983
75  0.678801
76  0.886375
77 -0.039741
78  0.082514
79 -1.071169
80 -0.651827
81 -1.711309
82  0.081732
83  0.263497
84  0.275766
85 -1.641987
86  0.043221
87 -1.780726
88  0.545411
89  1.937702
90  0.162111
91  0.060950
92  1.401884
93  0.177331
94  0.066051
95 -1.095271
96 -1.233487
97 -0.964103
98 -0.302411
99  0.542511

[100 rows x 1 columns]

In [33]:
store.put('obj2',frame,format = 'table')
store.select('obj2',where = ['index>=10 and index <= 15'])

           a
10  2.062966
11 -0.274239
12 -2.192404
13 -0.980734
14  1.468118
15 -2.503070

In [34]:
store.close()

In [35]:
frame.to_hdf('pydata-book-2nd-edition/mydata.h5','obj3',format = 'table')
pd.read_hdf('pydata-book-2nd-edition/mydata.h5','obj3',where = ['index<5'])

          a
0  0.775751
1 -1.815641
2 -0.938153
3 -0.105750
4 -1.050281

### 读取Microsoft Excel文件

In [36]:
xlsx = pd.ExcelFile('pydata-book-2nd-edition/examples/ex1.xlsx')

In [37]:
pd.read_excel(xlsx,'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
frame = pd.read_excel('pydata-book-2nd-edition/examples/ex1.xlsx','Sheet1')

In [39]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [40]:
writer = pd.ExcelWriter('pydata-book-2nd-edition/examples/ex2.xlsx')
frame.to_excel(writer,'Sheet1')
writer.save()

## 6.3 Web APIs交互

In [42]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [44]:
data = resp.json()
data[0]['title']

'API: getting the "densified" values of a Categorical (preserving categories dtype) ?'

In [45]:
issues = pd.DataFrame(data,columns = ['number','title','labels','state'])
issues

,number,title,labels,state
0,26410,"API: getting the ""densified"" values of a Categ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
1,26409,DEPR: deprecate get_values,[],open
2,26408,BUG: MultiIndex not dropping nan level and inv...,[],open
3,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
4,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
5,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
6,26404,Fix type annotations in pandas.core.indexes.da...,[],open
7,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
8,26402,DOC: Test doctests in pandas/core/tools/dateti...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
9,26401,Test doctests in pandas/core/tools/datetimes.py,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
10,26400,ENH: Support multiple opening hours intervals ...,[],open
11,26399,ENH: Support nested renaming / selection,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
12,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
13,26397,DataFrame.describe excludes top and freq for e...,[],open
14,26396,CLN: remove compat.lrange,"[{'id': 49747336, 'node_id': 'MDU6TGFiZWw0OTc0...",open
15,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
16,26394,BUG: to_numeric does not validate the errors k...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
17,26393,Holiday based on the lunar calendar?,[],open
18,26392,[TEST] Add two more parameters to the test_dti...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
19,26391,[PERF] Get rid of MultiIndex conversion in Int...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
20,26390,BUG: assigning Series.array / PandasArray to c...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,26389,Converting json to csv,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
22,26388,read_parquet S3 dir support,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
23,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
24,26384,Remove Deprecated Azure CI Step,[],open
25,26383,Prefixed batch script commands with call,[],open
26,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,26380,ENH: Implementing NEP 18's __array_function__,[],open
28,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open

## 6.4 数据库交互

In [46]:
import sqlite3
query = '''
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),
c REAL, d INTEGER
);'''

In [47]:
con = sqlite3.connect('mydata.sqlite')

In [48]:
con.execute(query)

In [49]:
con.commit()

In [50]:
data = [('Atlanta','Georgia',1.25,6),
       ('Tallahassee','Florida',2.6,3),
       ('Sacramento','California',1.7,5)]
stmt = 'INSERT INTO test VALUES(?,?,?,?)'
con.executemany(stmt,data)

In [51]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [54]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [55]:
pd.DataFrame(rows,columns = [x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [56]:
import sqlalchemy as sqla

In [57]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [58]:
pd.read_sql('select *from test',db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []